app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 01 Feb 2014 05:51:38 UTC +00:00], ["text", "1"], ["title", "Example Entry"], ["updated_at", Sat, 01 Feb 2014 05:51:38 UTC +00:00]]
---
	def create
		@post = Post.new(post_params)
		@post.save